Revit 2027 API
WaterTintEnableType Enumeration
 The enumerated type representing the permitted values for the asset property "WaterTintEnable" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WaterTintEnableType
Public Enumeration WaterTintEnableType
public enum class WaterTintEnableType
type WaterTintEnableType
Members
Member name | Value | Description
Algae | 1
Custom | 7
Lake | 5
Murky | 2
Ocean | 6
ReflectingPool | 3
River | 4
Tropical | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace